# pandas输入输出
http://pandas.pydata.org/pandas-docs/stable/api.html#input-output

In [1]:
import pandas as pd
data = pd.read_csv('student.csv')

In [2]:
data

    Student ID  name   age  gender
0         1100  Kelly   22  Female
1         1101    Clo   21  Female
2         1102  Tilly   22  Female
3         1103   Tony   24    Male
4         1104  David   20    Male
5         1105  Catty   22  Female
6         1106      M    3  Female
7         1107      N   43    Male
8         1108      A   13    Male
9         1109      S   12    Male
10        1110  David   33    Male
11        1111     Dw    3  Female
12        1112      Q   23    Male
13        1113      W   21  Female

# 保存成pickle文件

In [ ]:
data.to_pickle('student.pickle')

# 读取数据头部

In [24]:
data.head()
data.columns

Index(['Student ID', 'name ', 'age', 'gender'], dtype='object')

# 区域数据查看

In [37]:
data.loc[0:3]#查看1到3行

   Student ID  name   age  gender
0        1100  Kelly   22  Female
1        1101    Clo   21  Female
2        1102  Tilly   22  Female
3        1103   Tony   24    Male

In [7]:
data.iloc[0:3]

   Student ID  name   age  gender
0        1100  Kelly   22  Female
1        1101    Clo   21  Female
2        1102  Tilly   22  Female